txt = """Любіть Україну як сонце любіть
як вітер і трави і води
В годину щасливу і в радості мить
любіть у годину негоди
Любіть Україну у сні й наяву
вишневу свою Україну
красу її вічно живу і нову
і мову її солов'їну
Без неї — ніщо ми як порох і дим
розвіяний в полі вітрами
Любіть Україну всім серцем своїм
і всіми своїми ділами"""
lst_1 = txt.split()
lst_2 = []
for i in lst_1:
    cnt = lst_1.count(i)
    lst_2.append(cnt)
dict_1 = dict(zip(lst_1, lst_2))
max_1 = max(dict_1, key=dict_1.get)
max_2 = max(dict_1.values())
min_1 = min(dict_1, key=dict_1.get)
min_2 = min(dict_1.values())
print(dict_1)
print('Слово ', max_1, 'Встречается ', max_2, 'раз')
print('Слово ', min_1, 'Встречается ', min_2, 'раз')
